# product = {
#     "ноутбук": 10,
#     "телефон": 5,
#     "телевизор": 3
# }
# print(product)
# print(product.get("макбук", "Товара нет"))
#
# product["компьютер"] = 4
# product["телефон"] = 8
# print(product)
#
# n = product.pop("телевизор")
# print("телевизоров было: ", n)
# print(product)

zoo = {
    "лев": 3,
    "тигр": 2,
    "слон": 5,
    "обезьяна": 7
}

zoo["жираф"] = 4
zoo["слон"] = 4
del zoo["тигр"]
print("Количество животных в зоопарке: ",zoo)
print("Количество обезьян в зоопарке: ",zoo.get("обезьяна"))

if "крокодил" in zoo:
    print("Крокодилы есть:", zoo.get("крокодил"))
else:
    print("Крокодилов в зоопарке нет")
